SaitovSP/src/Documents/УстановитьЦеныБлюд/УстановитьЦеныБлюд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановитьЦеныБлюд</name>
  <registerRecords>InformationRegister.ЦеныБлюд</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/InformationRegisters/ЦеныБлюд/ЦеныБлюд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныБлюд</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Блюдо</name>
    <type>
      <types>CatalogRef.Блюда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/Documents/УстановитьЦеныБлюд/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныБлюд
	Движения.ЦеныБлюд.Записывать = Истина;
	Для Каждого ТекСтрокаБлюда Из Блюда Цикл
		Движение = Движения.ЦеныБлюд.Добавить();
		Движение.Период = Дата;
		Движение.Блюдо = ТекСтрокаБлюда.Блюдо;
		Движение.Автор = Автор;
		Движение.Цена = ТекСтрокаБлюда.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
